---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.ManyElementInFamily
source: html/f3e4a8bc-a119-adc6-6011-5ca35736da66.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.ManyElementInFamily Property

Family definition contains too many elements. Consider simplification of the family.

## Syntax (C#)
```csharp
public static FailureDefinitionId ManyElementInFamily { get; }
```